app/views/articles/show.html.erb

               <li>
                  <small><%= pluralize(@article.user.articles.count, "article") if @article.user.articles %></small>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 4]]