app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"
---
   def index
      @articles = Article.paginate(page:  params[:page], per_page: 5)

INSERT INTO "articles" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Test"], ["description", "This is a test"], ["user_id", 4], ["created_at", "2016-05-11 19:37:48.950384"], ["updated_at", "2016-05-11 19:37:48.950384"]]
---
   def create
      #render plain: params[:article].inspect
      @article = Article.new(article_params)
      @article.user = current_user
      if @article.save

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "This is a new article - edited"], ["description", "description of new article edited"], ["updated_at", "2016-05-06 21:23:26.077345"], ["id", 7]]
---
   def update
      set_article
      if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 9]]
---
   def destroy
      set_article  #call set_article method from below
      @article.destroy