app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "blufirenator@gmail.com"]]
---
   def create  #form submission handled here
      #debugger
      user = User.find_by(email: params[:session][:email].downcase)