app/controllers/users_controller.rb

UPDATE "users" SET "username" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "Anthony1"], ["email", "me@gmail.com"], ["password_digest", "$2a$10$5PL.uYGK5.KSmlDBGQtGo.rz5Jdw1MErd9/76grWqVK4uyGqwiawC"], ["updated_at", "2016-05-12 02:16:49.918537"], ["id", 5]]
---
   def update

      if @user.update(user_params)